Revit 2027 API
BuiltInFailures.CurtainWallFailures.MultipleIdsInCurtainSystem Property
 A Curtain System cannot be based on faces from multiple elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultipleIdsInCurtainSystem { get; }
Public Shared ReadOnly Property MultipleIdsInCurtainSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultipleIdsInCurtainSystem {
	FailureDefinitionId^ get ();
}
static member MultipleIdsInCurtainSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace